flow-around-controlled-moving-cylinder/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Mesh-Fluid;
    locations         faceCenters;
    patches           (cylinder);
    
    readData
    (
      Displacement-Cylinder
    );
    
    writeData
    (
      Force
    );
  }; 
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1000;
  nu  nu [ 0 2 -1 0 0 0 0 ] 1.0e-06;
}
